// Необхідно написати програму яка буде виводити інформацію за умовами при яких число виводитиметься з правильним словом: 
//"рік", "роки" або "років". Тобто. "29 років" чи "4 роки".

// Умови виконання ДЗ

// Рік отримувати через prompt()
// Зробити перевірку що користувач ввів число та це число не є від'ємним

//
//Перетворення до числа
/*let number = Number('4');
console.log(number, typeof number);*/

var age = prompt("Вкажіть ваш вік");

if ( typeof age == Number && age > 0){
if (age == 1){
    console.log('Вам ' + age + ' рік');
}
else if (age > 1 && age <= 4 ){
    console.log('Вам ' + age + ' роки') ;
}
else if (age >= 5 && age <= 20){
    console.log('Вам ' + age + ' років') ;
}}
else {
    console.log("Ви ввели не вірне число!")
}


