// Необхідно написати програму яка буде виводити інформацію за умовами при яких число виводитиметься з правильним словом: 
//"рік", "роки" або "років". Тобто. "29 років" чи "4 роки".

// Умови виконання ДЗ

// Рік отримувати через prompt()
// Зробити перевірку що користувач ввів число та це число не є від'ємним

//
//Перетворення до числа
/*let number = Number('4');
console.log(number, typeof number);*/

var age = prompt("Вкажіть ваш вік");

if ( typeof age == Number && age > 0){
if (age == 1){
    console.log('Вам ' + age + ' рік');
}
else if (age > 1 && age <= 4 ){
    console.log('Вам ' + age + ' роки') ;
}
else if (age >= 5 && age <= 20){
    console.log('Вам ' + age + ' років') ;
}}
else {
    console.log("Ви ввели не вірне число!")
}

// Напишіть програму яка буде приймати два значення, 
// перше це одиниця вимірювання (кілометри, години та кілограми), друге значення це кількість, а потім переводити ці значення:

// Кілометри в метри
// години в хвилини
// Кілограми в грами
// Зробити вивід отриманої інформації у вигляді - 10 км це 10000 м. 1 г це 60хв. 1 кг. це 1000 грм. 

// Умови виконання ДЗ

// В задачі не обов'язково використовувати prompt, просто запишіть значення в зміні
// Обов'язково при написані завдання використовуйте switch
// Продумати варіант якщо буде введена якась інша одиниця виміру
// Мудрувати та створювати валідацію не потрібно
var unitOfMeasurement = 'km', quantity = 10;

switch (unitOfMeasurement) {
    case "km":
        console.log(quantity + ' км це ' + quantity * 1000 + ' м');
        break;
    case "hours":
        console.log(quantity + 'г це ' + quantity * 60 + ' хв');
        break;
    case 'kg':
        console.log(quantity + ' кг це ' + quantity * 1000 + ' грм');
        default:
            text = "Значення не знайдено";
}
